# 4.9 Task Part 1

### This script contains the following points:
1. Importing Libraries
2. Importing Data 
3. Checking Data
4. Data Wrangling
5. Data Consistency Check
6. Data Combining
7. Exporting Data

# 01. Importing Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

# 02. Importing Data

In [2]:
# Project folder path
path=r'C:\Users\maryn\Documents\Data Projects\Instacart Basket Analysis'

In [3]:
# Import dataset orders_products_merged_agg.pkl
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_agg.pkl'))

In [4]:
# Import dataset customers.csv
customers = pd.read_csv(os.path.join(path,'02 Data', 'Original Data', 'customers.csv'), index_col = False)

# 03. Checking Data

In [5]:
# Display the information orders_products_merged_agg.pkl
ords_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,spending,spending_flag,ordering_behavior,order_freq_flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Mid-range product,Regularly busy,Regularly busy days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Mid-range product,Regularly busy,Slowest days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Mid-range product,Regularly busy,Slowest days,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Mid-range product,Least busy,Slowest days,Average orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Mid-range product,Least busy,Slowest days,Most orders,10,New customer,6.367797,Low spender,20.5,Non-frequent customer

In [6]:
ords_prods_merge.shape

(32404859, 24)

In [10]:
ords_prods_merge.dtypes

order_id                     int64
user_id                      int64
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
_merge                    category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
spending                   float64
spending_flag               object
ordering_behavior          float64
order_freq_flag             object
dtype: object

In [7]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
customers.shape

(206209, 10)

In [11]:
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

# 04. Data Wrangling

In [21]:
# Dropping 'date_joined' column from customers.csv as not usable for our analysis
customers = customers.drop(columns = ['date_joined'])

In [13]:
# Rename columns in accordance with column name standards
customers.rename(columns = {'First Name' : 'first_name'}, inplace = True)

In [14]:
customers.rename(columns = {'Surnam' : 'surname'}, inplace = True)

In [15]:
customers.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [16]:
customers.rename(columns = {'STATE' : 'state'}, inplace = True)

In [17]:
customers.rename(columns = {'Age' : 'age'}, inplace = True)

In [18]:
# Rename columns to better reflect their meaning
customers.rename(columns = {'n_dependants' : 'number_dependants'}, inplace = True)

In [19]:
customers.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [22]:
customers.head()

,user_id,first_name,surname,gender,state,age,number_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1,married,40374

# 05. Data Consistency Check

### Descriptive statistics

In [23]:
# View the descriptive statistics for df_ords
customers.describe().astype(int)

       user_id     age  number_dependants  income
count   206209  206209             206209  206209
mean    103105      49                  1   94632
std      59527      18                  1   42473
min          1      18                  0   25903
25%      51553      33                  0   59874
50%     103105      49                  1   93547
75%     154657      66                  3  124244
max     206209      81                  3  593901

#### No unusual data performance observed

### Mixed-Type Data

In [24]:
# Check for mixed types
for col in customers.columns.tolist():
    weird = (customers[[col]].map(type)!=customers[[col]].iloc[0].apply(type)).any(axis=1)
    if len (customers[weird])>0:
        print (col)

first_name

In [25]:
# Changing data type of the column 'first_name' to string type
customers['first_name'] = customers['first_name'].astype('str')

In [26]:
customers.dtypes

user_id               int64
first_name           object
surname              object
gender               object
state                object
age                   int64
number_dependants     int64
marital_status       object
income                int64
dtype: object

In [27]:
# Re-Check for mixed types
for col in customers.columns.tolist():
    weird = (customers[[col]].map(type)!=customers[[col]].iloc[0].apply(type)).any(axis=1)
    if len (customers[weird])>0:
        print (col)

#### there are no more mixed data types in any column

### Missing values

In [28]:
# Looking for missing values
customers.isnull().sum()

user_id              0
first_name           0
surname              0
gender               0
state                0
age                  0
number_dependants    0
marital_status       0
income               0
dtype: int64

#### No missing values found

### Duplicates

In [29]:
# Looking for duplicates
customers_dup = customers[customers.duplicated()]

In [30]:
customers_dup

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, number_dependants, marital_status, income]
Index: []

#### No duplicates found

# 06. Data Combining

In [33]:
# Check the datatype of 'user_id' as a shared column in both dataframes.
customers.dtypes['user_id']

dtype('int64')

In [34]:
ords_prods_merge.dtypes['user_id']

dtype('int64')

In [35]:
# Drop the existing '_merge' column from previous exercises
ords_prods_merge = ords_prods_merge.drop(columns=['_merge'])

In [36]:
ords_prods_merge.shape

(32404859, 23)

In [37]:
# Merge ords_prods_merge and customers using user_id as a key, add a merge flag
order_products_all = ords_prods_merge.merge(customers, on = 'user_id', indicator = True)

In [38]:
# Check the output
order_products_all.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,order_freq_flag,first_name,surname,gender,state,age,number_dependants,marital_status,income,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both

In [39]:
order_products_all.shape

(32404859, 32)

In [40]:
order_products_all.dtypes

order_id                     int64
user_id                      int64
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
spending                   float64
spending_flag               object
ordering_behavior          float64
order_freq_flag             object
first_name                  object
surname                     object
gender                      object
state                       object
age                          int64
number_dependants            int64
marital_status              object
income                       int64
_merge                    category
dtype: object

# 07. Exporting Data

In [41]:
# Exporting order_products_all as a order_products_all.pkl in pickle format
order_products_all.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'order_products_all.pkl'))